string = """径河三店码头潭公园东吴大道五环额湾竹叶海舵落口古田一路二四汉西宗关太平洋硚崇仁利济北友谊循礼门智阳黄浦街七徐州新村丹水池荣堤角滕子岗滠城天机场航空总部宋家巨龙盘宏图常青金银花长港火车站范湖王墩年中山江积玉桥螃蟹岬小龟洪广南宝通寺埠屯虎泉杨光谷珞雄华科技学佳武融秀藏佛祖岭柏林庙临嶂蔡甸凤凰农知音集贤孟铺永安堂十里钟拦复兴首义昌梅苑区楚鱼嘴亭岳铁罗和工业春沌风司体育心客运陶双商务云飞菱香惠赵条庄后市民之乘导视地线提醒搜索结果月日周六号历史记录清收方向设为起点终末班在此输入以检换时刻表第即将到还有预计添加本当前不营段分共完成距离列进间秒忽略确定指行下的数置规划暂无我取消已删除!"#$%&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~  发车时刻切换到根据历史数据预测添加成功始发终到点从请输入正确的站名数量已达上限单击提醒可查看信息请详细情界面红霞黄家湖武科大中医药大学白沙六路光霞张家湾烽火村八铺街复兴路彭刘杨司门口黄鹤楼昙华林武胜门积玉桥三层楼三角路徐家棚杨园铁四院余家头科普公园建设二路和平公园红钢城青宜居工人村武钢厂前武汉站东广场新城十一路码头潭公园五环体育中心二雅路海口三路金银湖公园金银湖园博园北轻工大学常青花园杨汊湖石桥唐家墩三眼桥香港路苗栗路大智路江汉路六渡桥汉正街武胜路琴台钟家村马鹦路建港前进村国博中心北国博中心南老关村江城大道车城东路东风公司黄陂广场百泰路青仔村横店裕福路天阳大道腾龙大道巨龙大道汤云海路马池园博园北园博园常码头武汉商务区王家墩东取水楼香港路三阳路徐家棚湖北大学新河街螃蟹岬小东门武昌火车站瑞安街建安街湖工大板桥野芷湖新路村大花岭江夏客厅谭鑫培公园北华街纸坊大街青龙山地铁小镇金潭路站宏图大道塔子湖中一路竹叶山赵家条黄浦路徐家棚徐东汪家墩岳家嘴梨园省博湖北日报中南医院水果湖洪山路小洪山街道口马房山文治街文昌路省农科院马湖野芷湖黄家湖地铁小镇军运村江安路紫阳湖武昌站东广场丁字桥马房山虎泉武汉体育学院光谷广场关山大道武汉东站湖口光谷同济医院光谷生物园光谷四路光谷五路光谷六路豹澥光谷七路长岭山未来一路未来三路左岭葛店南站武汉站西广场武东鼓架山花山新城花山河光谷五路新月溪公园单击以显示站点详情

"""

lis = []
for i in string:
    if i == "\n" or i == "、":
        continue
    if not (i in lis):
        lis .append(i)
for i in lis:
    print(i,end = '')
