#include "metro_line.h"
#include "gui.h"
#include "timestruct.h"
#define FILL_ARRAY(arr, val, n) do{ \
    for(size_t i = 0; i < (n); ++i) (arr)[i] = (val); \
}while(0)

const Station line_1[32] = {
    {1, "径河", "jinghe",                 5, 4,   0, 1, 0, 1, 1 , 0},
    {2, "三店", "sandian",                5, 5,   0, 1, 0, 0, 1 , 0},
    {3, "码头潭公园", "matoutangongyuan", 5, 6,   0, 1, 0, 0, 1 , 0},
    {4, "东吴大道", "dongwudadao",        5, 7,   0, 1, 0, 1, 1 , 0},
    {5, "五环大道", "wuhuandadao",        6, 8,   0, -1, 1, 0, 1 , 0},
    {6, "额头湾", "etouwan",              7, 9,   0, -1, 1, 0, 1 , 0},
    {7, "竹叶海", "zhuyehai",             8, 10,  0, -1, 1, 0, 1 , 0},
    {8, "舵落口", "duoluokou",            9, 11,  0, -1, 1, 0, 1 , 0},
    {9, "古田一路", "gutianyilu",         10, 12, 0, -1, 1, 0, 1 , 0},
    {10, "古田二路", "gutianerlu",        11, 13, 0, -1, 1, 0, 1 , 0},
    {11, "古田三路", "gutiansanlu",       12, 14, 0, -1, 1, 0, 1 , 0},
    {12, "古田四路", "gutiansilu",        13, 15, 0, -1, 1, 0, 1 , 0},
    {13, "汉西一路", "hanxiyilu",         14, 16, 0, -1, 1, 0, 1 , 0},
    {14, "宗关", "zongguan",              15, 17, 3, -1, 0, 1 ,1 ,10},
    {15, "太平洋", "taipingyang",         16, 17, 0, 0, -1, 0, 1, 0},
    {16, "硚口路", "qiaokoulu",           17, 17, 0, 0, 1, 0, 1, 0},
    {17, "崇仁路", "chongrenlu",          18, 17, 0, 0, -1, 0, 1, 0},
    {18, "利济北路", "lijibeilu",         19, 17, 0, 0, 1, 1, 1, 0},
    {19, "友谊路", "youyilu",             20, 16, 0, -1, 0, 0, 1, 0},
    {20, "循礼门", "xunlimen",            21, 15, 2, -1, 0, 0 ,1 ,16},
    {21, "大智路", "dazhilu",             22, 14, 0, 1, 1, 0, 1, 0},
    {22, "三阳路", "sanyanglu",           23, 13, 0, 1, 1, 0, 1, 0},
    {23, "黄浦路", "huangpulu",           24, 12, 0, 1, 1, 0, 1, 0},
    {24, "头道街", "toudaojie",           25, 11, 0, 1, 1, 0, 1, 0},
    {25, "二七路", "erqilu",              26, 10, 0, 1, 1, 0, 1, 0},
    {26, "徐州新村", "xuzhouxincun",      27, 9, 0, 1, 1, 0, 1, 0},
    {27, "丹水池", "danshuichi",          28, 8, 0, 1, 1, 0, 1, 0},
    {28, "新荣", "xinrong",               29, 7, 0, 1, 1, 0, 1, 0},
    {29, "堤角", "dijiao",                30, 6, 0, 1, 1, 0, 1, 0},
    {30, "滕子岗", "tengzigang",          31, 5, 0, 1, 1, 1, 1, 0},
    {31, "滠口新城", "shekouxincheng",    31, 4, 0, 1, 0, 0, 1, 0},
    {32, "汉口北", "hankoubei",           31, 3, 0, 1, 0, 1, 1, 0}
};



const Station line_2[38] = {   
    {1, "天河机场", "tianhejichang",          17, 0, 0, 1, 0, 1, 2, 0},
    {2, "航空总部", "hangkongzongbu",         17, 2, 0, 1,-1, 1, 2, 0},
    {3, "宋家岗", "songjiagang",              18, 3, 0, 1,-1, 0, 2, 0},
    {4, "巨龙大道", "julongdadao",            19, 4, 0, 1,-1, 0, 2, 0},
    {5, "盘龙城", "panlongcheng",             20, 5, 0, 1,-1, 1, 2, 0},
    {6, "宏图大道", "hongtudadao",            20, 6, 3, 0, 1, 1,2, 24},
    {7, "常青城", "changqingcheng",           19, 6, 0,-1,-1, 1, 2, 0},
    {8, "金银潭", "jinyintan",                18, 7, 0,-1, 0, 1, 2, 0},
    {9, "常青花园", "changqinghuayuan",       18, 8, 0,-1, 0, 0, 2, 0},
    {10, "长港路", "changganglu",             18, 9, 0,-1, 0, 0, 2, 0},
    {11, "汉口火车站", "hankouhuochezhan",    18, 10, 0,-1, 0, 0, 2, 0},
    {12, "范湖", "fanhu",                     18, 12, 3,-1,-1, 0 ,2,14},
    {13, "王家墩东", "wangjiadundong",        18, 13, 0, 1, 0, 1, 2, 0},
    {14, "青年路", "qingnianlu",              19, 14, 0, 0, 1, 1, 2, 0},
    {15, "中山公园", "zhongshangongyuan",     20, 14, 0, 0,-1, 1, 2, 0},
    {16, "循礼门", "xunlimen",                21, 15,-1,-1, 0, 0, 2, 20},
    {17, "江汉路", "jianghanlu",              22, 16, 0, 1,-1, 0, 2, 0},
    {18, "积玉桥", "jiyuqiao",                24, 18, 0, 1,-1, 0, 2, 0},
    {19, "螃蟹岬", "pangxiejia",              25, 19, 0, 1,-1, 0, 2, 0},
    {20, "小龟山", "xiaoguishan",             26, 20, 0, 1,-1, 0, 2, 0},
    {21, "洪山广场", "hongshanguangchang",    27, 21, 4, 1, 1, 1, 2,26},
    {22, "中南路", "zhongnanlu",              26, 22, 4,-1, 1, 1, 2,25},
    {23, "宝通寺", "baotongsi",               27, 23, 0,-1, 1, 0, 2, 0},
    {24, "街道口", "jiedaokou",               28, 24, 0,-1, 1, 0, 2, 0},
    {25, "广埠屯", "guangbutun",              29, 25, 0,-1, 1, 0, 2, 0},
    {26, "虎泉", "huquan",                    30, 26, 0,-1, 1, 0, 2, 0},
    {27, "杨家湾", "yangjiawan",              31, 27, 0,-1, 1, 1, 2, 0},
    {28, "光谷广场", "guangguguangchang",     32, 27, 0, 0, 1, 0, 2, 0},
    {29, "珞雄路", "luoxionglu",              33, 27, 0, 0,-1, 0, 2, 0},
    {30, "华中科技大学", "huazhongkejidaxue", 34, 27, 0, 0, 1, 0, 2, 0},
    {31, "光谷大道", "guanggudadao",          35, 27, 0, 0,-1, 1, 2, 0},
    {32, "佳园路", "jiayuanlu",               36, 28, 0, 1, 0, 1, 2, 0},
    {33, "武汉东站", "wuhandongzhan",         36, 29, 0, 1, 0, 0, 2, 0},
    {34, "黄龙山路", "huanglongshanlu",       36, 30, 0, 1, 0, 0, 2, 0},
    {35, "金融港北", "jinronggangbei",        36, 31, 0, 1, 0, 0, 2, 0},
    {36, "秀湖", "xiuhu",                     36, 32, 0, 1, 0, 1, 2, 0},
    {37, "藏龙东街", "zanglongdongjie",       37, 33, 0, 0, 1, 1, 2, 0},
    {38, "佛祖岭", "fozuling",                38, 33, 0, 1, 0, 1, 2, 0}
};
const Station line_3[24] = {
    {1, "沌阳大道", "zhuanyangdadao",         5, 27, 0, 1, 1, 1, 3, 0},
    {2, "东风公司", "dongfenggongsi",         6, 26, 0, 1, 1, 0, 3, 0},
    {3, "体育中心", "tiyuzhongxin",           7, 25, 0, 1, 1, 0, 3, 0},
    {4, "三角湖", "sanjiaohu",                8, 24, 0, 1, 1, 0, 3, 0},
    {5, "汉阳客运站", "hanyangkeyunzhan",    9, 23, 0, 1, 1, 0, 3, 0},
    {6, "四新大道", "sixindadao",            10, 22, 0, 1, 1, 0, 3, 0},
    {7, "陶家岭", "taojialing",              11, 21, 0, 1, 1, 0, 3, 0},
    {8, "龙阳村", "longyangcun",             12, 20, 0, 1, 1, 0, 3, 0},
    {9, "王家湾", "wangjiawan",              13, 19, 4, 1, 0, 0, 3,14},
    {10, "宗关", "zongguan",                 15, 17,-1,-1, 0, 1, 3, 14},
    {11, "双墩", "shuangdun",                15, 15, 0,-1,-1, 1, 3, 0},
    {12, "武汉商务区", "wuhanshangwuqu",     16, 14, 0,-1,-1, 0, 3, 0},
    {13, "云飞路", "yunfeilu",               17, 13, 0,-1,-1, 0, 3, 0},
    {14, "范湖", "fanhu",                    18, 12,-2,-1,-1, 1, 3, 12},
    {15, "菱角湖", "lingjiaohu",             19, 12, 0, 0,-1, 0, 3, 0},
    {16, "香港路", "xiangganglu",            20, 12, 0, 1, 1, 1, 3, 0},
    {17, "惠济二路", "huijierlu",            21, 11, 0, 1, 1, 0, 3, 0},
    {18, "赵家条", "zhaojiatiao",            22, 10, 0, 1, 1, 0, 3, 0},
    {19, "罗家庄", "luojiazhuang",           23, 9,  0, 1, 1, 0, 3, 0},
    {20, "二七小路", "erqixiaolu",           24, 8,  0, 1, 1, 1, 3, 0},
    {21, "兴业路", "xingyelu",               24, 7,  0, 1, 0, 0, 3, 0},
    {22, "后湖大道", "houhudadao",           24, 6,  0, 1, 0, 1, 3, 0},
    {23, "市民之家", "shiminzijia",          22, 6,  0, 0,-1, 0, 3, 0},
    {24, "宏图大道", "hongtudadao",          20, 6, -2, 0, 1, 1, 3, 6}
};
const Station line_4[37] = {
    {1, "柏林", "bailin",                    1, 17, 0,-1, 0, 1, 4, 0},
    {2, "新庙村", "xinmiaocun",              2, 17, 0, 0,-1, 0, 4, 0},
    {3, "临嶂大道", "linzhangdadao",         3, 17, 0, 0, 1, 0, 4, 0},
    {4, "蔡甸广场", "caidianguangchang",     4, 17, 0, 0,-1, 1, 4, 0},
    {5, "凤凰路", "fenghuanglu",             5, 18, 0,-1, 1, 0, 4, 0},
    {6, "新农", "xinnong",                   6, 19, 0,-1, 1, 0, 4, 0},
    {7, "知音", "zhiyin",                    7, 20, 0,-1, 1, 1, 4, 0},
    {8, "集贤", "jixian",                    8, 20, 0, 0,-1, 0, 4, 0},
    {9, "新天", "xintian",                   9, 20, 0, 1, 1, 1, 4, 0},
    {10, "黄金口", "huangjinkou",            9, 19, 0,-1, -1, 1, 4, 0},
    {11, "孟家铺", "mengjiapub",             10, 19, 0, 0,-1, 0, 4, 0},
    {12, "永安堂", "yongantang",            11, 19, 0, 0, 1, 0, 4, 0},
    {13, "玉龙路", "yulonglu",              12, 19, 0, 0,-1, 0, 4, 0},
    {14, "王家湾", "wangjiawan",            13, 19,-3, 1, 0, 1, 4, 9},
    {15, "十里铺", "shilipu",               14, 20, 0, 0, 1, 1, 4, 0},
    {16, "七里庙", "qilimiao",              15, 20, 0, 0,-1, 0, 4, 0},
    {17, "五里墩", "wulidun",               16, 20, 0, 0, 1, 0, 4, 0},
    {18, "汉阳火车站", "hanyanghuochezhan", 17, 20, 0, 0,-1, 0, 4, 0},
    {19, "钟家村", "zhongjiacun",           18, 20, 0, 0, 1, 0, 4, 0},
    {20, "拦江路", "lanjianglu",            19, 20, 0, 0,-1, 1, 4, 0},
    {21, "复兴路", "fuxinglu",              21, 22, 0, 0, 1, 1, 4, 0},
    {22, "首义路", "shouyilu",              22, 22, 0, 0,-1, 0, 4, 0},
    {23, "武昌火车站", "wuchanghuochezhan", 23, 22, 0, 0, 1, 0, 4, 0},
    {24, "梅苑小区", "meiyuanxiaoqu",       24, 22, 0, 0,-1, 0, 4, 0},
    {25, "中南路", "zhongnanlu",            26, 22,-2,-1, 1, 1, 4, 22},
    {26, "洪山广场", "hongshanguangchang",  27, 21,-2, 1, 1, 1, 4, 21},
    {27, "楚河汉街", "chuhehanjie",         28, 20, 0, 1, 1, 0, 4, 0},
    {28, "青鱼嘴", "qingyuzui",             29, 19, 0, 1, 1, 0, 4, 0},
    {29, "东亭", "dongting",                30, 18, 0, 1, 1, 0, 4, 0},
    {30, "岳家嘴", "yuejiazui",             31, 17, 0, 1, 1, 0, 4, 0},
    {31, "铁机路", "tiejilu",               32, 16, 0, 1, 1, 0, 4, 0},
    {32, "罗家港", "luojiagang",            33, 15, 0, 1, 1, 0, 4, 0},
    {33, "园林路", "yuanlinlu",             34, 14, 0, 1, 1, 0, 4, 0},
    {34, "仁和路", "renhelu",               35, 13, 0, 1, 1, 0, 4, 0},
    {35, "工业四路", "gongyesilu",          36, 12, 0, 1, 1, 0, 4, 0},
    {36, "杨春湖", "yangchunhu",            37, 11, 0, 1, 1, 0, 4, 0},
    {37, "武汉火车站", "wuhanhuochezhan",   38, 10, 0, 1, 1, 1, 4, 0}
};

//下面定义每一站之间的时间间隔
const uint16_t time_line_1[31] = {
    99, 176, 93, 148, 148, 84, 72, 128, 136, 81, 71, 
    73, 82, 141, 93, 102, 79, 79, 88, 97, 90, 103, 
    107, 82, 71, 136, 128, 104, 92, 100, 304};

Timetable timetable_line_1 = {{6, 0 ,0}, {23, 0, 0}, 300};

const uint16_t time_line_2[37] = {
    600, 143, 204, 164, 395, 289, 201, 109, 
    173, 141, 122, 141, 100, 95, 154, 90, 
    329, 158, 93, 117, 97, 142, 124, 95, 161, 
    144, 132, 79, 101, 82, 137, 149, 106, 204, 
    160, 200, 102};

Timetable timetable_line_2 = {{6, 0 ,0}, {23, 0, 0}, 240};


const uint16_t time_line_3[23] = {
    145, 84, 145, 156, 93, 136, 91,
    111, 253, 98, 183, 123, 89, 168, 
    93, 93, 90, 88, 76, 125, 118, 167, 242};

Timetable timetable_line_3 = {{6, 0 ,0}, {23, 0, 0}, 360};


const uint16_t time_line_4[36] = {
    94, 155, 103, 91, 98, 86, 94, 93, 129, 100, 
    75, 85, 79, 84, 60, 56, 70, 71, 68, 82, 58, 
    57, 57, 50, 50, 59, 52, 58, 56, 73, 86, 88,
    69, 91, 107, 78};

Timetable timetable_line_4 = {{6, 0 ,0}, {23, 0, 0}, 240};



const MetroLine metro_lines[4] = {
    {line_1, 32, COLOR_LINE1, 6 , 1, time_line_1, &timetable_line_1},
    {line_2, 38, COLOR_LINE2, 17, 2, time_line_2, &timetable_line_2},
    {line_3, 24, COLOR_LINE3, 8 , 3, time_line_3, &timetable_line_3},
    {line_4, 37, COLOR_LINE4, 14, 4, time_line_4, &timetable_line_4},
};

