#include "metro_line.h"
#include "gui.h"
#include "timestruct.h"


const Station line_1[32] = {
//onlyid  id   x    y     transfer    x'   y' draw  line name             pinyin
    {  0,   1,   5,   4,  { 0, 0 } ,   1,   0,   1,   1, "径河"          , "jinghe"         },
    {  1,   2,   5,   5,  { 0, 0 } ,   1,   0,   0,   1, "三店"          , "sandian"        },
    {  2,   3,   5,   6,  { 6, 0 } ,   1,   1,   0,   1, "码头潭公园"    , "matoutangongyuan"},
    {  3,   4,   5,   7,  { 0, 0 } ,   1,   0,   1,   1, "东吴大道"      , "dongwudadao"    },
    {  4,   5,   6,   8,  { 0, 0 } ,  -1,   1,   0,   1, "五环大道"      , "wuhuandadao"    },
    {  5,   6,   7,   9,  { 0, 0 } ,  -1,   1,   0,   1, "额头湾"        , "etouwan"        },
    {  6,   7,   8,  10,  { 0, 0 } ,  -1,   1,   0,   1, "竹叶海"        , "zhuyehai"       },
    {  7,   8,   9,  11,  { 0, 0 } ,  -1,   1,   0,   1, "舵落口"        , "duoluokou"      },
    {  8,   9,  10,  12,  { 0, 0 } ,  -1,   1,   0,   1, "古田一路"      , "gutianyilu"     },
    {  9,  10,  11,  13,  { 0, 0 } ,  -1,   1,   0,   1, "古田二路"      , "gutianerlu"     },
    { 10,  11,  12,  14,  { 0, 0 } ,  -1,   1,   0,   1, "古田三路"      , "gutiansanlu"    },
    { 11,  12,  13,  15,  { 0, 0 } ,  -1,   1,   0,   1, "古田四路"      , "gutiansilu"     },
    { 12,  13,  14,  16,  { 0, 0 } ,  -1,   1,   0,   1, "汉西一路"      , "hanxiyilu"      },
    { 13,  14,  15,  17,  { 3, 0 } ,  -1,   0,   1,   1, "宗关"          , "zongguan"       },
    { 14,  15,  16,  17,  { 0, 0 } ,   0,  -1,   0,   1, "太平洋"        , "taipingyang"    },
    { 15,  16,  17,  17,  { 0, 0 } ,   0,   1,   0,   1, "硚口路"        , "qiaokoulu"      },
    { 16,  17,  18,  17,  { 0, 0 } ,   0,  -1,   0,   1, "崇仁路"        , "chongrenlu"     },
    { 17,  18,  19,  17,  { 0, 0 } ,   0,   1,   1,   1, "利济北路"      , "lijibeilu"      },
    { 18,  19,  20,  16,  { 0, 0 } ,  -1,   0,   0,   1, "友谊路"        , "youyilu"        },
    { 19,  20,  21,  15,  { 2, 0 } ,  -1,   0,   0,   1, "循礼门"        , "xunlimen"       },
    { 20,  21,  22,  14,  { 6, 0 } ,   1,   1,   0,   1, "大智路"        , "dazhilu"        },
    { 21,  22,  23,  13,  { 7, 0 } ,   1,   0,   0,   1, "三阳路"        , "sanyanglu"      },
    { 22,  23,  24,  12,  { 8, 0 } ,  -1,   0,   0,   1, "黄浦路"        , "huangpulu"      },
    { 23,  24,  25,  11,  { 0, 0 } ,   1,   1,   0,   1, "头道街"        , "toudaojie"      },
    { 24,  25,  26,  10,  { 0, 0 } ,   1,   1,   0,   1, "二七路"        , "erqilu"         },
    { 25,  26,  27,   9,  { 0, 0 } ,   1,   1,   0,   1, "徐州新村"      , "xuzhouxincun"   },
    { 26,  27,  28,   8,  { 0, 0 } ,   1,   1,   0,   1, "丹水池"        , "danshuichi"     },
    { 27,  28,  29,   7,  { 0, 0 } ,   1,   1,   0,   1, "新荣"          , "xinrong"        },
    { 28,  29,  30,   6,  { 0, 0 } ,   1,   1,   0,   1, "堤角"          , "dijiao"         },
    { 29,  30,  31,   5,  { 0, 0 } ,   1,   1,   1,   1, "滕子岗"        , "tengzigang"     },
    { 30,  31,  31,   4,  { 0, 0 } ,   1,   0,   0,   1, "滠口新城"      , "shekouxincheng" },
    { 31,  32,  31,   3,  { 0, 0 } ,   1,   0,   1,   1, "汉口北"        , "hankoubei"      }
};



const Station line_2[38] = {   
//onlyid  id   x    y          trans   x'   y' draw  line name             pinyin
    { 32,   1,  18,   1,  { 0, 0 } ,   1,  -1,   1,   2, "天河机场"        , "tianhejichang"    },
    { 33,   2,  18,   2,  { 0, 0 } ,   1,  -1,   1,   2, "航空总部"        , "hangkongzongbu"   },
    { 34,   3,  19,   3,  { 0, 0 } ,   1,  -1,   0,   2, "宋家岗"          , "songjiagang"      },
    { 35,   4,  20,   4,  { 7, 0 } ,   1,   0,   0,   2, "巨龙大道"        , "julongdadao"      },
    { 36,   5,  21,   5,  { 0, 0 } ,   1,  -1,   1,   2, "盘龙城"          , "panlongcheng"     },
    { 37,   6,  21,   6,  { 3, 8 } ,  -1,   1,   1,   2, "宏图大道"        , "hongtudadao"      },
    { 38,   7,  19,   6,  { 0, 0 } ,  -1,  -1,   1,   2, "常青城"          , "changqingcheng"   },
    { 39,   8,  18,   7,  { 0, 0 } ,  -1,   0,   1,   2, "金银潭"          , "jinyintan"        },
    { 40,   9,  18,   8,  { 6, 0 } ,  -1,   1,   0,   2, "常青花园"        , "changqinghuayuan" },
    { 41,  10,  18,   9,  { 0, 0 } ,  -1,   0,   0,   2, "长港路"          , "changganglu"      },
    { 42,  11,  18,  10,  { 0, 0 } ,  -1,   0,   0,   2, "汉口火车站"      , "hankouhuochezhan" },
    { 43,  12,  18,  12,  { 3, 0 } ,  -1,  -1,   0,   2, "范湖"            , "fanhu"            },
    { 44,  13,  18,  13,  { 7, 0 } ,  -1,   1,   1,   2, "王家墩东"        , "wangjiadundong"   },
    { 45,  14,  19,  14,  { 0, 0 } ,   0,   1,   1,   2, "青年路"          , "qingnianlu"       },
    { 46,  15,  20,  14,  { 0, 0 } ,   0,  -1,   1,   2, "中山公园"        , "zhongshangongyuan"},
    { 19,  16,  21,  15,  {-1, 0 } ,  -1,   0,   0,   2, "循礼门"          , "xunlimen"         },
    { 48,  17,  22,  16,  { 6, 0 } ,   1,  -1,   0,   2, "江汉路"          , "jianghanlu"       },
    { 49,  18,  24,  18,  { 5, 0 } ,  -1,   0,   0,   2, "积玉桥"          , "jiyuqiao"         },
    { 50,  19,  25,  19,  { 7, 0 } ,   1,   0,   0,   2, "螃蟹岬"          , "pangxiejia"       },
    { 51,  20,  26,  20,  { 0, 0 } ,   1,  -1,   0,   2, "小龟山"          , "xiaoguishan"      },
    { 52,  21,  27,  21,  { 4, 0 } ,   1,   1,   1,   2, "洪山广场"        , "hongshanguangchang"},
    { 53,  22,  26,  22,  { 4, 0 } ,  -1,  -1,   1,   2, "中南路"          , "zhongnanlu"       },
    { 54,  23,  27,  23,  { 0, 0 } ,  -1,   1,   0,   2, "宝通寺"          , "baotongsi"        },
    { 55,  24,  28,  24,  { 8, 0 } ,   1,   0,   0,   2, "街道口"          , "jiedaokou"        },
    { 56,  25,  29,  25,  { 0, 0 } ,   1,   0,   0,   2, "广埠屯"          , "guangbutun"       },
    { 57,  26,  30,  26,  {11, 0 } ,  -1,   1,   0,   2, "虎泉"            , "huquan"           },
    { 58,  27,  31,  27,  { 0, 0 } ,  -1,   0,   1,   2, "杨家湾"          , "yangjiawan"       },
    { 59,  28,  32,  27,  {11, 0 } ,  -1,   1,   0,   2, "光谷广场"        , "guangguguangchang"},
    { 60,  29,  33,  27,  { 0, 0 } ,   0,  -1,   0,   2, "珞雄路"          , "luoxionglu"       },
    { 61,  30,  34,  27,  { 0, 0 } ,   0,   1,   0,   2, "华中科技大学"    , "huazhongkejidaxue"},
    { 62,  31,  35,  27,  { 0, 0 } ,   0,  -1,   1,   2, "光谷大道"        , "guanggudadao"     },
    { 63,  32,  36,  28,  { 0, 0 } ,   1,   0,   1,   2, "佳园路"          , "jiayuanlu"        },
    { 64,  33,  36,  29,  {11, 0 } ,  -1,   1,   0,   2, "武汉东站"        , "wuhandongzhan"    },
    { 65,  34,  36,  30,  { 0, 0 } ,   1,   0,   0,   2, "黄龙山路"        , "huanglongshanlu"  },
    { 66,  35,  36,  31,  { 0, 0 } ,   1,   0,   0,   2, "金融港北"        , "jinronggangbei"   },
    { 67,  36,  36,  32,  { 0, 0 } ,   1,   0,   1,   2, "秀湖"            , "xiuhu"            },
    { 68,  37,  37,  33,  { 0, 0 } ,   0,   1,   1,   2, "藏龙东街"        , "zanglongdongjie"  },
    { 69,  38,  38,  33,  { 0, 0 } ,   1,   0,   1,   2, "佛祖岭"          , "fozuling"         }
};



const Station line_3[24] = {
//onlyid  id   x    y   trans   x'   y' draw  line name             pinyin
    { 70,   1,   5,  27,  { 0, 0 } ,   1,   1,   1,   3, "沌阳大道"      , "zhuanyangdadao"  },
    { 71,   2,   6,  26,  { 6, 0 } ,   1,   1,   0,   3, "东风公司"      , "dongfenggongsi"  },
    { 72,   3,   7,  25,  { 0, 0 } ,   1,   1,   0,   3, "体育中心"      , "tiyuzhongxin"    },
    { 73,   4,   8,  24,  { 0, 0 } ,   1,   1,   0,   3, "三角湖"        , "sanjiaohu"       },
    { 74,   5,   9,  23,  { 0, 0 } ,   1,   1,   0,   3, "汉阳客运站"    , "hanyangkeyunzhan"},
    { 75,   6,  10,  22,  { 0, 0 } ,   1,   1,   0,   3, "四新大道"      , "sixindadao"      },
    { 76,   7,  11,  21,  { 0, 0 } ,   1,   1,   0,   3, "陶家岭"        , "taojialing"      },
    { 77,   8,  12,  20,  { 0, 0 } ,   1,   1,   0,   3, "龙阳村"        , "longyangcun"     },
    { 78,   9,  13,  19,  { 4, 0 } ,   1,   0,   0,   3, "王家湾"        , "wangjiawan"      },
    { 13,  10,  15,  17,  {-1, 0 } ,  -1,   0,   1,   3, "宗关"          , "zongguan"        },
    { 80,  11,  15,  14,  { 0, 0 } ,  -1,   0,   1,   3, "双墩"          , "shuangdun"       },
    { 81,  12,  16,  13,  { 7, 0 } ,  -1,   0,   0,   3, "武汉商务区"    , "wuhanshangwuqu"  },
    { 82,  13,  17,  12,  { 0, 0 } ,  -1,  -1,   1,   3, "云飞路"        , "yunfeilu"        },
    { 43,  14,  18,  12,  {-2, 0 } ,  -1,  -1,   0,   3, "范湖"          , "fanhu"           },
    { 83,  15,  19,  12,  { 0, 0 } ,   0,   1,   0,   3, "菱角湖"        , "lingjiaohu"      },
    { 84,  16,  20,  12,  { 6, 7 } ,  -1,  -1,   1,   3, "香港路"        , "xiangganglu"     },
    { 85,  17,  21,  11,  { 0, 0 } ,   1,   1,   0,   3, "惠济二路"      , "huijierlu"       },
    { 86,  18,  22,  10,  { 8, 0 } ,   1,   0,   0,   3, "赵家条"        , "zhaojiatiao"     },
    { 87,  19,  23,   9,  { 0, 0 } ,   1,   1,   0,   3, "罗家庄"        , "luojiazhuang"    },
    { 88,  20,  24,   8,  { 0, 0 } ,   1,   1,   1,   3, "二七小路"      , "erqixiaolu"      },
    { 89,  21,  24,   7,  { 0, 0 } ,   1,   0,   0,   3, "兴业路"        , "xingyelu"        },
    { 90,  22,  24,   6,  { 0, 0 } ,   1,   0,   1,   3, "后湖大道"      , "houhudadao"      },
    { 91,  23,  23,   6,  { 0, 0 } ,   0,  -1,   0,   3, "市民之家"      , "shiminzijia"     },
    { 37,  24,  21,   6,  {-8,-2 } ,  -1,   1,   1,   3, "宏图大道"      , "hongtudadao"     }
};



const Station line_4[37] = {
//onlyid  id   x    y         trans    x'   y' draw  line name             pinyin
    { 92,   1,   1,  17,  { 0, 0 } ,  -1,   0,   1,   4, "柏林"          , "bailin"             },
    { 93,   2,   2,  17,  { 0, 0 } ,   0,  -1,   0,   4, "新庙村"        , "xinmiaocun"         },
    { 94,   3,   3,  17,  { 0, 0 } ,   0,   1,   0,   4, "临嶂大道"      , "linzhangdadao"      },
    { 95,   4,   4,  17,  { 0, 0 } ,   0,  -1,   1,   4, "蔡甸广场"      , "caidianguangchang"  },
    { 96,   5,   5,  18,  { 0, 0 } ,  -1,   1,   0,   4, "凤凰路"        , "fenghuanglu"        },
    { 97,   6,   6,  19,  { 0, 0 } ,  -1,   1,   0,   4, "新农"          , "xinnong"            },
    { 98,   7,   7,  20,  { 0, 0 } ,  -1,   1,   1,   4, "知音"          , "zhiyin"             },
    { 99,   8,   8,  20,  { 0, 0 } ,   0,  -1,   0,   4, "集贤"          , "jixian"             },
    {100,   9,   9,  20,  { 0, 0 } ,   1,   1,   1,   4, "新天"          , "xintian"            },
    {101,  10,   9,  19,  { 0, 0 } ,  -1,  -1,   1,   4, "黄金口"        , "huangjinkou"        },
    {102,  11,  10,  19,  { 0, 0 } ,   0,  -1,   0,   4, "孟家铺"        , "mengjiapub"         },
    {103,  12,  11,  19,  { 0, 0 } ,   0,   1,   0,   4, "永安堂"        , "yongantang"         },
    {104,  13,  12,  19,  { 0, 0 } ,   0,  -1,   0,   4, "玉龙路"        , "yulonglu"           },
    { 78,  14,  13,  19,  {-3, 0 } ,   1,   0,   1,   4, "王家湾"        , "wangjiawan"         },
    {105,  15,  14,  20,  { 0, 0 } ,   0,   1,   1,   4, "十里铺"        , "shilipu"            },
    {106,  16,  15,  20,  { 0, 0 } ,   0,  -1,   0,   4, "七里庙"        , "qilimiao"           },
    {107,  17,  16,  20,  { 0, 0 } ,   0,   1,   0,   4, "五里墩"        , "wulidun"            },
    {108,  18,  17,  20,  { 0, 0 } ,   0,  -1,   0,   4, "汉阳火车站"    , "hanyanghuochezhan"  },
    {109,  19,  18,  20,  { 6, 0 } ,   1,   1,   0,   4, "钟家村"        , "zhongjiacun"        },
    {110,  20,  19,  20,  { 0, 0 } ,   0,  -1,   1,   4, "拦江路"        , "lanjianglu"         },
    {111,  21,  21,  22,  { 5, 0 } ,  -1,   1,   1,   4, "复兴路"        , "fuxinglu"           },
    {112,  22,  22,  22,  { 0, 0 } ,   0,  -1,   0,   4, "首义路"        , "shouyilu"           },
    {113,  23,  23,  22,  { 7, 0 } ,   1,   1,   0,   4, "武昌火车站"    , "wuchanghuochezhan"  },
    {114,  24,  24,  22,  { 0, 0 } ,   0,  -1,   0,   4, "梅苑小区"      , "meiyuanxiaoqu"      },
    { 53,  25,  26,  22,  {-2, 0 } ,  -1,  -1,   1,   4, "中南路"        , "zhongnanlu"         },
    { 52,  26,  27,  21,  {-2, 0 } ,   1,   1,   1,   4, "洪山广场"      , "hongshanguangchang" },
    {115,  27,  28,  20,  { 0, 0 } ,   1,   1,   0,   4, "楚河汉街"      , "chuhehanjie"        },
    {116,  28,  29,  19,  { 0, 0 } ,   1,   1,   0,   4, "青鱼嘴"        , "qingyuzui"          },
    {117,  29,  30,  18,  { 0, 0 } ,   1,   1,   0,   4, "东亭"          , "dongting"           },
    {118,  30,  31,  17,  { 8, 0 } ,   1,   1,   0,   4, "岳家嘴"        , "yuejiazui"          },
    {119,  31,  32,  16,  { 0, 0 } ,   1,   1,   0,   4, "铁机路"        , "tiejilu"            },
    {120,  32,  33,  15,  { 0, 0 } ,   1,   1,   0,   4, "罗家港"        , "luojiagang"         },
    {121,  33,  34,  14,  { 0, 0 } ,   1,   1,   0,   4, "园林路"        , "yuanlinlu"          },
    {122,  34,  35,  13,  { 0, 0 } ,   1,   1,   0,   4, "仁和路"        , "renhelu"            },
    {123,  35,  36,  12,  { 0, 0 } ,   1,   1,   0,   4, "工业四路"      , "gongyesilu"         },
    {124,  36,  37,  11,  { 0, 0 } ,   1,   1,   0,   4, "杨春湖"        , "yangchunhu"         },
    {125,  37,  38,  10,  { 0, 0 } ,   1,   1,   1,   4, "武汉火车站"    , "wuhanhuochezhan"    }
};


const Station line_5[27] = {
//onlyid  id     x    y      trans    x'   y' draw  line name             pinyin
    {126,   1,  20,  30, { 0, 0 } ,  -1,   0,   1,   5, "红霞"          , "hongxia"                },
    {127,   2,  20,  29, { 0, 0 } ,  -1,   0,   0,   5, "黄家湖(武科大)" , "huangjiahuwukeda"       },
    {128,   3,  20,  28, { 0, 0 } ,  -1,   0,   1,   5, "中医药大学"     , "zhongyiyaodaxue"         },
    {129,   4,  21,  28, { 0, 0 } ,   1,   1,   1,   5, "白沙六路"       , "baishaliulu"             },
    {130,   5,  21,  27, { 0, 0 } ,  -1,   0,   0,   5, "光霞"           , "guangxia"                },
    {131,   6,  21,  26, { 0, 0 } ,  -1,   0,   0,   5, "张家湾"         , "zhangjiawan"             },
    {132,   7,  21,  25, { 0, 0 } ,  -1,   0,   0,   5, "烽火村"         , "fenghuocun"              },
    {133,   8,  21,  24, { 0, 0 } ,  -1,   0,   0,   5, "八铺街"         , "bapujie"                 },
    {111,   9,  21,  22, {-4, 0 } ,  -1,   1,   0,   5, "复兴路"         , "fuxinglu"                },
    {135,  10,  21,  21, { 0, 0 } ,  -1,  -1,   1,   5, "彭刘杨"         , "pengliuyang"             },
    {136,  11,  22,  20, { 0, 0 } ,  -1,   0,   0,   5, "司门口黄鹤楼"   , "simenkouhuanghelou"      },
    {137,  12,  23,  19, { 0, 0 } ,  -1,   0,   0,   5, "昙华林武胜门"   , "tanhualinwushengmen"     },
    { 49,  13,  24,  18, {-2, 0 } ,  -1,   0,   0,   5, "积玉桥"         , "jiyuqiao"                },
    {139,  14,  25,  17, { 0, 0 } ,  -1,  -1,   0,   5, "三层楼"         , "sancenglou"              },
    {140,  15,  26,  16, { 0, 0 } ,  -1,  -1,   0,   5, "三角路"         , "sanjiaolu"               },
    {141,  16,  28,  14, { 7, 8 } ,   1,   0,   0,   5, "徐家棚"         , "xujiapeng"               },
    {142,  17,  29,  13, { 0, 0 } ,   1,   1,   0,   5, "杨园铁四院"     , "yangyuantiesiyuan"       },
    {143,  18,  30,  12, { 0, 0 } ,   1,   1,   0,   5, "余家头"         , "yujiatou"                },
    {144,  19,  31,  11, { 0, 0 } ,   1,   1,   0,   5, "科普公园"       , "kepugongyuan"            },
    {145,  20,  32,  10, { 0, 0 } ,   1,   1,   0,   5, "建设二路"       , "jiansheerlu"             },
    {146,  21,  33,   9, { 0, 0 } ,   1,   1,   0,   5, "和平公园"       , "hepinggongyuan"          },
    {147,  22,  34,   8, { 0, 0 } ,   1,   1,   0,   5, "红钢城"         , "honggangcheng"           },
    {148,  23,  35,   7, { 0, 0 } ,  -1,  -1,   1,   5, "青宜居"         , "qingyiju"                },
    {149,  24,  36,   7, { 0, 0 } ,   1,  -1,   1,   5, "工人村"         , "gongrencun"              },
    {150,  25,  37,   8, { 0, 0 } ,   1,  -1,   0,   5, "武钢"           , "wugang"                  },
    {151,  26,  38,   9, { 0, 0 } ,   1,  -1,   0,   5, "厂前"           , "changqian"               },
    {152,  27,  39,  10, { 0, 0 } ,   1,  -1,   1,   5, "武汉站东广场"   , "wuhanzhandongguangchang" }
};


const Station line_6[32] = {
    {153,   1,   4,   6, { 0, 0 },  -1,   0,   1,   6, "新城十一路"     , "xinchengshiyilu"      },
    {  2,   2,   5,   6, {-1, 0 },   1,   1,   0,   6, "码头潭公园"     , "matoutangongyuan"     },
    {155,   3,   7,   6, { 0, 0 },   0,  -1,   0,   6, "五环体育中心"   , "wuhuantiyuzhongxin"   },
    {156,   4,   9,   6, { 0, 0 },   0,   1,   0,   6, "二雅路"         , "eryalu"               },
    {157,   5,  11,   6, { 0, 0 },   0,  -1,   0,   6, "海口三路"       , "haikousanlu"          },
    {158,   6,  13,   6, { 0, 0 },  -1,   1,   1,   6, "金银湖公园"     , "jinyinhugongyuan"     },
    {159,   7,  14,   7, { 0, 0 },  -1,   1,   0,   6, "金银湖"         , "jinyinhu"             },
    {160,   8,  15,   8, { 7, 0 },  -1,   1,   1,   6, "园博园北"       , "yuanboyuanbei"        },
    {161,   9,  16,   8, { 0, 0 },   0,  -1,   0,   6, "轻工大学"       , "qinggongdaxue"        },
    { 40,  10,  18,   8, {-2, 0 },  -1,   1,   0,   6, "常青花园"       , "changqinghuayuan"     },
    {163,  11,  19,   8, { 0, 0 },   0,  -1,   1,   6, "杨汊湖"         , "yangchahu"            },
    {164,  12,  20,   9, { 0, 0 },  -1,   0,   1,   6, "石桥"           , "shiqiao"              },
    {165,  13,  20,  10, { 0, 0 },  -1,   0,   0,   6, "唐家墩"         , "tangjiadun"           },
    {166,  14,  20,  11, { 0, 0 },  -1,   0,   0,   6, "三眼桥"         , "sanyanqiao"           },
    { 84,  15,  20,  12, {-7,-3 },  -1,  -1,   1,   6, "香港路"         , "xiangganglu"          },
    {168,  16,  21,  13, { 0, 0 },   1,   0,   0,   6, "苗栗路"         , "miaolilu"             },
    { 20,  17,  22,  14, {-1, 0 },   1,   1,   1,   6, "大智路"         , "dazhilu"              },
    { 48,  18,  22,  16, {-2, 0 },   1,  -1,   1,   6, "江汉路"         , "jianghanlu"           },
    {171,  19,  21,  17, { 0, 0 },   1,   1,   0,   6, "六渡桥"         , "liuduqiao"            },
    {172,  20,  20,  18, { 0, 0 },   1,   1,   1,   6, "汉正街"         , "hanzhengjie"          },
    {173,  21,  19,  18, { 0, 0 },  -1,   0,   1,   6, "武胜路"         , "wushenglu"            },
    {174,  22,  18,  19, { 0, 0 },  -1,  -1,   1,   6, "琴台"           , "qintai"               },
    {109,  23,  18,  20, {-4, 0 },   1,   1,   1,   6, "钟家村"         , "zhongjiacun"          },
    {176,  24,  17,  21, { 0, 0 },   1,   1,   0,   6, "马鹦路"         , "mayinglu"             },
    {177,  25,  16,  22, { 0, 0 },   1,   1,   0,   6, "建港"           , "jiangang"             },
    {178,  26,  15,  23, { 0, 0 },   1,   1,   0,   6, "前进村"         , "qianjincun"           },
    {179,  27,  14,  24, { 0, 0 },   1,   1,   0,   6, "国博中心北"     , "guobozhongxinbei"     },
    {180,  28,  13,  25, { 0, 0 },   1,   1,   0,   6, "国博中心南"     , "guobozhongxinnan"     },
    {181,  29,  12,  26, { 0, 0 },   1,   1,   1,   6, "老关村"         , "laoguancun"           },
    {182,  30,  10,  26, { 0, 0 },   0,  -1,   0,   6, "江城大道"       , "jiangchengdadao"      },
    {183,  31,   8,  26, { 0, 0 },   1,   1,   0,   6, "车城东路"       , "chechengdonglu"       },
    { 71,  32,   6,  26, {-3, 0 },   1,   1,   1,   6, "东风公司"       , "dongfenggongsi"       }
};

const Station line_7[36] = {
    {185,   1,  27,   0, { 0, 0 },   1,   0,   1,   7, "黄陂广场"     , "huangpiguangchang"      },
    {186,   2,  26,   0, { 0, 0 },   0,  -1,   0,   7, "百泰路"       , "baitailu"               },
    {187,   3,  25,   0, { 0, 0 },   0,   1,   0,   7, "青仔村"       , "qingzaicun"             },
    {188,   4,  24,   0, { 0, 0 },   0,  -1,   1,   7, "横店"         , "hengdian"               },
    {189,   5,  23,   1, { 0, 0 },   1,   1,   0,   7, "裕福路"       , "yufulu"                 },
    {190,   6,  22,   2, { 0, 0 },   1,   1,   0,   7, "天阳大道"     , "tianyangdadao"          },
    {191,   7,  21,   3, { 0, 0 },   1,   1,   0,   7, "腾龙大道"     , "tenglongdadao"          },
    { 35,   8,  20,   4, {-2, 0 },   1,   0,   1,   7, "巨龙大道"     , "julongdadao"            },
    {193,   9,  17,   4, { 0, 0 },  -1,  -1,   1,   7, "汤云海路"     , "tangyunhailu"           },
    {194,  10,  15,   6, { 0, 0 },   1,   0,   1,   7, "马池"         , "machi"                  },
    {160,  11,  15,   8, {-6, 0 },  -1,   1,   0,   7, "园博园北"     , "yuanboyuanbei"          },
    {196,  12,  15,  10, { 0, 0 },  -1,   0,   0,   7, "园博园"       , "yuanboyuan"             },
    {197,  13,  15,  12, { 0, 0 },  -1,   0,   1,   7, "常码头"       , "changmatou"             },
    { 81,  14,  16,  13, {-3, 0 },  -1,   0,   1,   7, "武汉商务区"   , "wuhanshangwuqu"         },
    { 44,  15,  18,  13, {-2, 0 },  -1,   1,   0,   7, "王家墩东"     , "wangjiadundong"         },
    {200,  16,  19,  13, { 0, 0 },   1,   0,   1,   7, "取水楼"       , "qushuilou"              },
    { 84,  17,  20,  12, {-3,-6 },  -1,  -1,   1,   7, "香港路"       , "xiangganglu"            },
    { 21,  18,  23,  13, {-1, 0 },   1,   0,   0,   7, "三阳路"       , "sanyanglu"              },
    {141,  19,  28,  14, {-8,-5 },   1,   0,   1,   7, "徐家棚"       , "xujiapeng"              },
    {204,  20,  28,  16, { 0, 0 },   1,   1,   1,   7, "湖北大学"     , "hubeidaxue"             },
    {205,  21,  27,  17, { 0, 0 },   1,   1,   0,   7, "新河街"       , "xinhejie"               },
    { 50,  22,  25,  19, {-2, 0 },   1,   0,   0,   7, "螃蟹岬"       , "pangxiejia"             },
    {207,  23,  23,  21, { 0, 0 },  -1,   0,   1,   7, "小东门"       , "xiaodongmen"            },
    {113,  24,  23,  22, {-4, 0 },   1,   1,   0,   7, "武昌火车站"   , "wuchanghuochezhan"      },
    {209,  25,  23,  24, { 0, 0 },   1,   0,   0,   7, "瑞安街"       , "ruianjie"               },
    {210,  26,  23,  25, { 0, 0 },   1,   0,   0,   7, "建安街"       , "jiananjie"              },
    {211,  27,  23,  26, { 0, 0 },   1,   0,   0,   7, "湖工大"       , "hugongda"               },
    {212,  28,  23,  27, { 0, 0 },   1,   0,   0,   7, "板桥"         , "banqiao"                },
    {213,  29,  23,  28, { 8, 0 },   1,   0,   0,   7, "野芷湖"       , "yezhihu"                },
    {214,  30,  23,  29, { 0, 0 },   1,   0,   0,   7, "新路村"       , "xinlucun"               },
    {215,  31,  23,  30, { 0, 0 },   1,   0,   0,   7, "大花岭"       , "dahualing"              },
    {216,  32,  23,  31, { 0, 0 },   1,   0,   0,   7, "江夏客厅"     , "jiangxiaketing"         },
    {217,  33,  23,  32, { 0, 0 },   1,   0,   0,   7, "谭鑫培公园"   , "tanxinpeigongyuan"      },
    {218,  34,  23,  33, { 0, 0 },   1,   0,   0,   7, "北华街"       , "beihuajie"              },
    {219,  35,  23,  34, { 0, 0 },   1,   0,   0,   7, "纸坊大街"     , "zhifangdajie"           },
    {220,  36,  23,  35, { 0, 0 },   1,   0,   1,   7, "青龙山地铁小镇", "qinglongshanditiezhen"  }
};

const Station line_8[26] = {
    {221,   1,   22,    5, { 0, 0 },   1,   0,   1,   8, "金潭路"     , "jintanlu"                  },
    { 37,   2,   21,    6, {-2,-3 },  -1,   1,   1,   8, "宏图大道"     , "hongtudadao"             },
    {223,   3,   21,    7, { 0, 0 },   1,   0,   0,   8, "塔子湖"       , "tazihu"                  },
    {224,   4,   21,    8, { 0, 0 },   1,   0,   0,   8, "中一路"       , "zhongyilu"               },
    {225,   5,   21,    9, { 0, 0 },   1,   0,   1,   8, "竹叶山"       , "zhuyeshan"               },
    { 86,   6,   22,   10, {-3, 0 },   1,   0,   0,   8, "赵家条"       , "zhaojiatiao"             },
    { 22,   7,   24,   12, {-1, 0 },   -1,   0,   1,   8, "黄浦路"       , "huangpulu"               },
    {141,   8,   28,   14, {-5,-7 },   1,   0,   0,   8, "徐家棚"       , "xujiapeng"               },
    {229,   9,   29,   15, { 0, 0 },   1,   0,   0,   8, "徐东"         , "xudong"                  },
    {230,  10,   30,   16, { 0, 0 },   1,  -1,   0,   8, "汪家墩"       , "wangjiadun"              },
    {118,  11,   31,   17, {-4, 0 },   1,   0,   0,   8, "岳家嘴"       , "yuejiazui"               },
    {232,  12,   32,   18, { 0, 0 },   1,   0,   1,   8, "梨园"         , "liyuan"                  },
    {233,  13,   32,   19, { 0, 0 },   1,   0,   1,   8, "省博湖北日报" , "shengbohubeiribao"       },
    {234,  14,   31,   20, { 0, 0 },   1,   0,   0,   8, "中南医院"     , "zhongnanyiyuan"          },
    {235,  15,   30,   21, { 0, 0 },   1,   0,   0,   8, "水果湖"       , "shuiguohu"               },
    {236,  16,   29,   22, { 0, 0 },   1,   0,   0,   8, "洪山路"       , "hongshanlu"              },
    {237,  17,   28,   23, { 0, 0 },   1,   0,   1,   8, "小洪山"       , "xiaohongshan"            },
    { 55,  18,   28,   24, {-2, 0 },   1,   0,   0,   8, "街道口"       , "jiedaokou"               },
    {239,  19,   28,   26, {11, 0 },  -1,   1,   0,   8, "马房山"       , "mafangshan"              },
    {240,  20,   28,   27, { 0, 0 },   -1,   0,   1,   8, "文治街"       , "wenzhijie"               },
    {241,  21,   27,   28, { 0, 0 },   1,   1,   1,   8, "文昌路"       , "wenchanglu"              },
    {242,  22,   26,   28, { 0, 0 },   0,   -1,   0,   8, "省农科院"     , "shengnongkeyuan"         },
    {243,  23,   25,   28, { 0, 0 },   0,   1,   0,   8, "马湖"         , "mahu"                    },
    {213,  24,   23,   28, {-7, 0 },   1,   1,   1,   8, "野芷湖"       , "yezhihu"                 },
    {245,  25,   22,   29, { 0, 0 },  -1,   0,   1,   8, "黄家湖地铁小镇", "huangjiahu ditiexiaozhen"},
    {246,  26,   22,   30, { 0, 0 },  -1,   0,   1,   8, "军运村"       , "junyuncun"               }
};

const Station line_11[23] = {
    {247,   1,   20,   23, { 0, 0 },  -1,   0,   1,  11, "江安路"      , "jianganlu"                 },
    {248,   2,   22,   23, { 0, 0 },   0,   1,   0,  11, "紫阳湖"      , "ziyanghu"                  },
    {249,   3,   24,   23, { 0, 0 },   1,   0,   1,  11, "武昌站东广场", "wuchangzhandongguangchang" },
    {250,   4,   26,   25, { 0, 0 },   1,   0,   1,  11, "丁字桥"      , "dingziqiao"                },
    {239,   5,   28,   26, {-8, 0 },  -1,   1,   0,  11, "马房山"      , "mafangshan"                },
    { 57,   6,   30,   26, {-2, 0 },  -1,   1,   0,  11, "虎泉"        , "huquan"                    },
    {253,   7,   31,   26, { 0, 0 },   1,  -1,   1,  11, "武汉体育学院", "wuhantiyuxueyuan"          },
    { 59,   8,   32,   27, {-2, 0 },  -1,   1,   0,  11, "光谷广场"    , "guangguguangchang"         },
    {255,   9,   34,   29, { 0, 0 },  -1,   1,   1,  11, "关山大道"    , "guanshandadao"             },
    { 64,  10,   36,   29, {-2, 0 },  -1,   1,   0,  11, "武汉东站"    , "wuhandongzhan"             },
    {257,  11,   37,   29, { 0, 0 },   0,   -1,   0,  11, "湖口"        , "hukou"                     },
    {258,  12,   38,   29, { 0, 0 },   0,   1,   0,  11, "光谷同济医院", "guanggutongjiyiyuan"       },
    {259,  13,   39,   29, { 0, 0 },   0,   -1,   0,  11, "光谷生物园"  , "guanggushengwuyuan"        },
    {260,  14,   40,   29, { 0, 0 },   0,   1,   0,  11, "光谷四路"    , "guanggusilu"               },
    {261,  15,   41,   29, {19, 0 },   1,   -1,   0,  11, "光谷五路"    , "guangguwulu"               },
    {262,  16,   42,   29, { 0, 0 },   0,   1,   0,  11, "光谷六路"    , "guangguliulu"              },
    {263,  17,   43,   29, { 0, 0 },   0,   -1,   0,  11, "豹澥"        , "baoxie"                    },
    {264,  18,   44,   29, { 0, 0 },   0,   1,   0,  11, "光谷七路"    , "guangguqilu"               },
    {265,  19,   45,   29, { 0, 0 },   0,   -1,   0,  11, "长岭山"      , "changlingshan"             },
    {266,  20,   46,   29, { 0, 0 },   0,   1,   0,  11, "未来一路"    , "weilaiyilu"                },
    {267,  21,   47,   29, { 0, 0 },   0,   -1,   0,  11, "未来三路"    , "weilaisanlu"               },
    {268,  22,   48,   29, { 0, 0 },   0,   1,   0,  11, "左岭"        , "zuoling"                   },
    {269,  23,   49,   29, { 0, 0 },   1,   0,   1,  11, "葛店南站"    , "gediannanzhan"             }
};


const Station line_19[7] = {
    {270,   1,  39,  11, { 0, 0 },   1,   0,   1,  19, "武汉站西广场"  , "wuhanzhanxiguangchang"    },
    {271,   2,  39,  14, { 0, 0 },   1,   0,   0,  19, "武东"          , "wudong"                   },
    {272,   3,  39,  17, { 0, 0 },   1,  -1,   1,  19, "鼓架山"        , "gujiashan"                },
    {273,   4,  41,  19, { 0, 0 },   1,  -1,   1,  19, "花山新城"      , "huashanxincheng"          },
    {274,   5,  41,  21, { 0, 0 },   1,   0,   0,  19, "花山河"        , "huashanhe"                },
    {261,   6,  41,  29,{-11, 0 },   1,  -1,   0,  19, "光谷五路"      , "guangguwulu"              },
    {276,   7,  41,  30, { 0, 0 },   1,   0,   1,  19, "新月溪公园"    , "xinyuexigongyuan"         }
};




//下面定义每一站之间的时间间隔
const uint16_t time_line_1[31] = {
    99, 176, 93, 148, 148, 84, 72, 128, 136, 81, 71, 
    73, 82, 141, 93, 102, 79, 79, 88, 97, 90, 103, 
    107, 82, 71, 136, 128, 104, 92, 100, 304};

Timetable timetable_line_1 = {{6, 0 ,0}, {23, 0, 0}, 313};

const uint16_t time_line_2[37] = {
    600, 143, 204, 164, 395, 289, 201, 109, 
    173, 141, 122, 141, 100, 95, 154, 90, 
    329, 158, 93, 117, 97, 142, 124, 95, 161, 
    144, 132, 79, 101, 82, 137, 149, 106, 204, 
    160, 200, 102};

Timetable timetable_line_2 = {{6, 0 ,0}, {23, 0, 0}, 248};


const uint16_t time_line_3[23] = {
    145, 84, 145, 156, 93, 136, 91,
    111, 253, 98, 183, 123, 89, 168, 
    93, 93, 90, 88, 76, 125, 118, 167, 242};

Timetable timetable_line_3 = {{6, 0 ,0}, {23, 0, 0}, 372};


const uint16_t time_line_4[36] = {
    94, 155, 103, 91, 98, 86, 94, 93, 129, 100, 
    75, 85, 79, 84, 60, 56, 70, 71, 68, 82, 58, 
    57, 57, 50, 50, 59, 52, 58, 56, 73, 86, 88,
    69, 91, 107, 78};

Timetable timetable_line_4 = {{6, 0 ,0}, {23, 0, 0}, 255};

const uint16_t time_line_5[26] = {
    120, 120, 150, 120, 130, 140, 160, 110, 90, 
    100, 95, 120, 135, 125, 130, 115, 120, 130, 
    140, 125, 135, 120, 130, 140, 150, 160};

Timetable timetable_line_5 = {{6, 0 ,0}, {23, 0, 0}, 367};

const uint16_t time_line_6[31] = {
    130, 120, 115, 120, 140, 130, 150, 125, 130, 120,
    115, 125, 110, 120, 115, 110, 120, 125, 115, 120,
    140, 110, 120, 130, 125, 130, 120, 135, 140, 150, 130
};

Timetable timetable_line_6 = {{6, 0, 0}, {23, 0, 0}, 613};

const uint16_t time_line_7[35] = {
    140, 220, 210, 200, 130, 125, 130, 120, 125, 135,
    130, 140, 130, 125, 120, 115, 125, 130, 180, 125,
    120, 115, 110, 125, 120, 115, 125, 120, 130, 140,
    150, 135, 125, 120, 115
};

Timetable timetable_line_7 = {{6, 0, 0}, {23, 0, 0}, 252};

const uint16_t time_line_8[25] = {
    120, 125, 115, 120, 125, 130, 140, 125, 120, 115,
    120, 125, 115, 120, 115, 120, 125, 115, 120, 115,
    120, 115, 125, 150, 140
};

Timetable timetable_line_8 = {{6, 0, 0}, {23, 0, 0}, 435};

const uint16_t time_line_11[22] = {
    120, 130, 125, 135, 120, 115, 130, 125, 135, 120,
    125, 120, 115, 125, 110, 120, 125, 140, 130, 125,
    120, 135
};

Timetable timetable_line_11 = {{6, 0, 0}, {23, 0, 0}, 497};

const uint16_t time_line_19[6] = {
    240, 210, 230, 150, 300, 90
};

Timetable timetable_line_19 = {{6, 0, 0}, {22, 30, 0}, 553};

const MetroLine metro_lines[LINE_COUNT] = {
    {line_1, 32, COLOR_LINE1, 1, time_line_1, &timetable_line_1},
    {line_2, 38, COLOR_LINE2, 2, time_line_2, &timetable_line_2},
    {line_3, 24, COLOR_LINE3, 3, time_line_3, &timetable_line_3},
    {line_4, 37, COLOR_LINE4, 4, time_line_4, &timetable_line_4},
    {line_5, 27, COLOR_LINE5, 5, time_line_5, &timetable_line_5},
    {line_6, 32, COLOR_LINE6, 6, time_line_6, &timetable_line_6},
    {line_7, 36, COLOR_LINE7, 7, time_line_7, &timetable_line_7},
    {line_8, 26, COLOR_LINE8, 8, time_line_8, &timetable_line_8},
    {line_11, 23, COLOR_LINE11, 11, time_line_11, &timetable_line_11},
    {line_19, 7, COLOR_LINE19, 19, time_line_19, &timetable_line_19}
};


 /**
  * 
  */


const MetroLine * get_metro_line(int8_t line_number)
{
    for (int8_t i = 0; i < LINE_COUNT; i++)
    {
        if (metro_lines[i].line_number == line_number)
        {
            return metro_lines + i;
        }
    }
    return NULL;
}

const Station * get_station(const Station * sta)
{
    for (int8_t i = 0; i < LINE_COUNT; i++)
    {
        for (int j = 0; j < metro_lines[i].count; j++)
        {
            if( metro_lines[i].stations[j].only_id == sta->only_id
                && metro_lines[i].stations[j].line_belonged == sta->line_belonged)
                return &metro_lines[i].stations[j];
        }
    }
    return NULL;

}

const Station * get_transfer_station(const Station * src, const Station ** first_dist)
{
    if(!src->transfer_line[0])
    {
        *first_dist = NULL;
        return NULL;
    }

    const MetroLine * line = get_metro_line(abs(src->transfer_line[0]));
    for (int j = 0; j < line->count; j++)
    {
        if(line->stations[j].only_id == src->only_id)
        {
            *first_dist = &line->stations[j];
        }
    }
    if (src->transfer_line[1])
    {
        line = get_metro_line(abs(src->transfer_line[1]));
        for (int j = 0; j < line->count; j++)
        {
            if(line->stations[j].only_id == src->only_id)
            {
                return &line->stations[j];
            }
        }
    }
    
    return NULL;

}


const Station * get_first_station(int8_t line_number, int8_t direction)
{
    if (direction == DIRECTION_UP)
    {
        return &get_metro_line(line_number)->stations[0];
    }
    else
    {
        return &get_metro_line(line_number)->stations[get_metro_line(line_number)->count - 1];
    }
}


/**
 * @brief 获取线路颜色
 * @param line_number 线路号码
 * @return 线路颜色
**/
lv_color_t get_line_color(int8_t line_number)
{
    return lv_color_hex(get_metro_line(line_number)->line_color);
}



